# Задание.

# У вас есть строка, представляющая собой предложение.
# Напишите программу, которая подсчитывает количество слов в этом предложении и выводит результат на экран.
sentence = "Это пример предложения для задачи со строками."
t = sentence.split()
print(len(t))