# # i = 2
# # while i <= 100:
# #     print(i)
# #     i += 2

# # i = 1

# # while i < 100:
# #     if i % 3 == 0 or i % 5 == 0:
# #         print(i)
# #     i +=1

# i = 1
# s = 0

# Тройка Пифагора - три натуральных числа a < b < c, для которых выполняется равенство

# a2 + b2 = c2
# Например, 32 + 42 = 9 + 16 = 25 = 52.

# Существует только одна тройка Пифагора, для которой a + b + c = 1000.
# Найдите произведение abc.

i = 0
s = 0

while i <= 1000:
    if i % 3 == 0 or i % 5 == 0:
        s += i
    i += 1
print(s)
    